In [1]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz'],
                    'value': [1, 2, 3]})

df2 = pd.DataFrame({'rkey': ['foo1', 'bar1', 'baz1'],
                    'value': [5, 6, 7]})

In [7]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3

In [8]:
df2

   rkey  value
0  foo1      5
1  bar1      6
2  baz1      7

In [12]:
df1.merge(df2, how='left')

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN

In [10]:
df1.merge(df2, left_on='lkey', right_on='rkey',suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

In [12]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [13]:
df1

     a  b
0  foo  1
1  bar  2

In [14]:
df2

     a  c
0  foo  3
1  baz  4

In [16]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [17]:
df1.merge(df2, how='left', on='a')

     a  b    c
0  foo  1  3.0
1  bar  2  NaN

In [18]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})

In [19]:
df1

  left
0  foo
1  bar

In [20]:
df2

   right
0      7
1      8

In [21]:
df1.merge(df2, how='cross')

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

<class 'dict'>